<template>
  <div class="washing-rules">
    <p>
      Благотворительная прачечная открыта для всех кому это необходимо. Стирка и
      стиральный порошок предоставляются бесплатно.
    </p>

    <UiList :legend="'Перед стиркой и сушкой вещей необходимо:'">
      <li>извлечь все из карманов, застегнуть молнии, расстегнуть пуговицы;</li>
      <li>
        перед стиркой детских игрушек необходимо убрать все музыкальные
        механизмы;
      </li>
      <li>
        перед стиркой рюкзаков убрать пластиковые зажимы, карабины и всё то, что
        может нанести вред барабану;
      </li>
      <li>
        проверить ярлыки на одежде и выбрать режим стирки согласно
        рекомендациям, а также согласно цвету.
      </li>
    </UiList>
    <UiList :legend="'Запрещено стирать:'">
      <li>подушки, одеяла, пледы;</li>
      <li>обувь;</li>
      <li>
        верхнюю одежду (только в индивидуальной стирке, на ваше усмотрение и под
        вашу ответственность);
      </li>
      <li>Нижнее бельё;</li>
      <li>
        изделия, предназначенные только для химчистки, изделия из натурального
        меха, кожи, замши, нубука и т.п.;
      </li>
      <li>
        спецодежду, на которой имеются сильнозагрязненные пятна - мазута, нефти,
        краски и т.д.;
      </li>
      <li>
        вещи, используемые для животных, а именно - подстилки, лежанки, пеленки,
        одежду, игрушки, и прочие предметы, которые контактируют с животными;
      </li>
      <li>
        вещи, на которых есть несъемные металлические/пластиковые карабины и
        прочие предметы, которые могут нанести вред оборудованию. Если есть
        необходимость в стирке данных вещей, то требуем обвязывать
        металлические/пластиковые предметы тканевыми платочками перед стиркой и
        помещать вещь в мешок для стирки;
      </li>
      <li>
        придверные половички и коридорные дорожки с ковровым и прорезиненным
        покрытием;
      </li>
      <li>
        кроме того, не рекомендуем стирать платья и костюмы со стразами,
        бусинами и пайетками (только в индивидуальной стирке, на ваше усмотрение
        и под вашу ответственность).
      </li>
    </UiList>
    <p>Администрация вправе отказать в приеме одежды на свое усмотрение.</p>
    <p>
      В рамках самообслуживания Клиент самостоятельно осуществляет выбор
      необходимых моющих средств, режимы и температуру стирки, а также
      сортировку, загрузку, разгрузку вещей, контроль процессов стирки.
    </p>
    <p>
      Если средства для стирки были принесены клиентом с собой, то они должны
      быть для автоматических стиральных машин, с пониженным пенообразованием, в
      противном случае, повышенное пенообразование отрицательно сказывается на
      работе оборудования, качестве стирки и полоскания вещей.
    </p>
    <p>
      В связи с отсутствием возможности контролировать, в каком состоянии вещь
      была принесена в прачечную до стирки, Клиент самостоятельно несет
      ответственность за вред, причинённый вещам и прачечному оборудованию.
    </p>
    <p>
      Забытые или оставленные вещи лежат в прачечной не более 14 дней, или на
      усмотрение администрации прачечной. Если владелец так и не объявился,
      администрация прачечной вправе их утилизировать. Если за это время с ними
      что-то случится, администрация прачечной ответственность за это не несет.
    </p>
    <p>
      На основании вышеизложенного, информируем вас о том, что администрация
      прачечной самообслуживания не несет ответственность за качество и
      результат стирки и сушки белья, за возможную деформацию изделия или
      изменение его внешнего вида, а также за результат стирки вещей, которые не
      предназначены для стирки.
    </p>
    <p>
      Соглашаясь с правилами вы также даёте согласие на обработку персональных
      данных.
    </p>
    <UiCheckbox v-model="modelValue">С правилами согласен</UiCheckbox>
  </div>
</template>

<script setup lang="ts">
  const modelValue = defineModel<boolean>({ required: true });
</script>

<style scoped lang="scss">
  .washing-rules {
    padding: 0 10px;
    line-height: 1.5em;
    & p {
      margin: 10px 10px 0 0;
      text-indent: 2em;
      text-align: justify;
    }
    & ul {
      margin: 10px 0;
    }
    & div {
      margin: 20px auto 0;
    }
  }
</style>
