export const PULSE = {
  name: 'Пульс Добра',
  subname: '',
  photo: 'pulse',
  date: 'постоянная, периодическая',
  description: [
    'Проект создан нашими партнерами: Отделом социального служения Горловской епархии Русской Православной Церкви. Он представляет собой акции по сдаче донорской крови и её компонентов. «Пульс добра» призван повысить количество потенциальных доноров среди молодёжи города Горловки путём проведения не менее пяти акций в год по донациям, которые необходимы медицинским учреждениям города.',
    'Директор, сотрудники и активисты «ДоброГорловки» регулярно присоединяются к этому полезному и важному делу.',
  ],
  partners: {
    ossibge: 'Отдел социального служения Горловской Епархии',
  },
  photos: {
    step2: ['pulse/step2_01.webp', 'pulse/step2_02.webp'],
    step1: [
      'pulse/step1_01.webp',
      'pulse/step1_02.webp',
      'pulse/step1_03.webp',
    ],
  },
};
