export const PULSE = {
  name: 'Пульс Добра',
  subname: '',
  photo: 'pulse',
  date: 'постоянная, периодическая',
  description: [
    'Проект создан нашими партнерами: Отделом социального служения Горловской епархии Русской Православной Церкви. Он представляет собой акции по сдаче донорской крови и её компонентов. «Пульс добра» призван повысить количество потенциальных доноров среди молодёжи города Горловки путём проведения не менее пяти акций в год по донациям, которые необходимы медицинским учреждениям города.',
    'Директор, сотрудники и активисты «ДоброГорловки» регулярно присоединяются к этому полезному и важному делу.',
  ],
  partners: {
    'ossibge': 'Отдел социального служения Горловской Епархии',
    'spk-gorlovka': 'Станция переливания крови г. Горловки',
    'spk-enakievo': 'Станция переливания крови г. Енакиево',
    'don-donbass': 'Доноры Донбасса',
    'wargonzo': 'WarGonzo',
    'kom-pravda': 'Комсомольская правда',
    'oplottv': 'Телеканал "Оплот ТВ"',
    'druzhina': 'Народная дружина',
  },
  photos: {
    step8: [
      'pulse/step8_01.webp',
      'pulse/step8_02.webp',
      'pulse/step8_03.webp',
      'pulse/step8_04.webp',
      'pulse/step8_05.webp',
      'pulse/step8_06.webp',
      'pulse/step8_07.webp',
    ],
    step7: ['pulse/step7_01.webp', 'pulse/step7_02.webp'],
    step6: ['pulse/step6_01.webp'],
    step5: [
      'pulse/step5_01.webp',
      'pulse/step5_02.webp',
      'pulse/step5_03.webp',
      'pulse/step5_04.webp',
      'pulse/step5_05.webp',
    ],
    step4: [
      'pulse/step4_01.webp',
      'pulse/step4_02.webp',
      'pulse/step4_03.webp',
      'pulse/step4_04.webp',
    ],
    step3: [
      'pulse/step3_01.webp',
      'pulse/step3_02.webp',
      'pulse/step3_03.webp',
    ],
    step2: ['pulse/step2_01.webp', 'pulse/step2_02.webp'],
    step1: [
      'pulse/step1_01.webp',
      'pulse/step1_02.webp',
      'pulse/step1_03.webp',
    ],
  },
  anonses: [
    {
      dateStart: new Date('2026-04-20'),
      dateEnd: new Date('2026-04-20'),
      text: [
        '20 апреля планируется очередная встреча доноров Дебальцева и Горловки, которая включит в себя совместную молитву, сдачу крови и просветительскую беседу о празднике Пасхи.',
      ],
    },
    {
      dateStart: new Date('2026-06-01'),
      dateEnd: new Date('2026-06-06'),
      text: [
        'Неделя донорской крови пройдет с 1 по 6 июня. Сдача крови будет посвящена Международному дню невинных детей — жертв агрессии.',
        'Встреча носит миссионерский характер. В ходе акции все желающие смогут не только сдать кровь, но и узнать о празднике Троицы, а также принять участие в просветительской беседе.',
      ],
    },
    {
      dateStart: new Date('2026-08-11'),
      dateEnd: new Date('2026-08-16'),
      text: [
        'С 11 по 16 августа состоится Неделя донорской крови, посвященная Дню молодежи (12 августа). Акция пройдет в миссионерском формате: организаторы посвятят ее приближающемуся празднику Преображения Господня.',
        'Это возможность для молодежи и всех желающих совместить донацию с духовным просвещением — в ходе мероприятия пройдут беседы об истории и традициях праздника.',
      ],
    },
  ],
};
