export const RILL = {
  name: 'Родник Добра',
  subname: '',
  photo: 'rill',
  date: 'постоянная, периодическая',
  description: [
    'Ситуация в Республике с водой уже долгое время остаётся очень напряжённой. «ДоброГорловка» не стоит в стороне с самого своего основания — наши волонтёры плечом к плечу, совместно с молодёжными организациями города, православной молодёжью Горловской епархии, помогают адресно закрывать потребности с питьевой водой маломобильным одиноким и пожилым людям. И вот с 26 августа стартовал новый шаг нашей работы в этой сфере! «ДоброГорловка» взяла в аренду у департамента ЖКХ г. Горловка, спецтехнику для развоза воды — КАМАЗ.',
  ],
  partners: {
    gorlovka: 'Горловская епархия',
    protorg: 'ООО "Про-Торг"',
  },
  photos: {
    step1_1: [
      'rill/step1_1_01.webp',
      'rill/step1_1_02.webp',
      'rill/step1_1_03.webp',
      'rill/step1_1_04.webp',
    ],
    step1_2: [
      'rill/step1_2_01.webp',
      'rill/step1_2_02.webp',
      'rill/step1_2_03.webp',
      'rill/step1_2_04.webp',
      'rill/step1_2_05.webp',
    ],
  },
};
