export const DIGITAL = {
  name: 'Экран Добра',
  subname: '',
  photo: 'screen',
  date: '01 июля 2026 – 05 апреля 2027',
  description: [
    'Проект направлен на создание системы информационно-психологической поддержки населения в публичных пространствах путем установки 7 уличных телеэкранов на остановочных комплексах в муниципалитетах ДНР. На экранах будет организован цикличный показ тематических видеороликов, в которых эксперты поднимают остросоциальные темы:',
  ],
  team: [
    {
      id: 1,
      surname: 'Протоиерей',
      name: 'Димитрий Абросимов',
      photo: 'persona2',
      post: 'Руководитель проекта, эксперт, автор тематических видеороликов',
      type: 'big',
      description:
        'Священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела по церковной благотворительности и социальному служению Горловской Епархии, руководитель Миссионерского отдела Горловской Епархии, Лектор российского общества "Знаниие", Магистр Богословия.',
    },
    {
      id: 2,
      surname: 'Протоиерей',
      name: 'Кирилл Щевелев',
      photo: 'persona11',
      post: 'Координатор проекта, эксперт, автор тематических видеороликов',
      type: 'big',
      description:
        'Священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела Религиозного Образования и Катехизации Горловской Епархии, Магистр Богословия.',
    },

    {
      id: 3,
      surname: 'Митрополит',
      name: 'Митрофан (Никитин)',
      photo: 'persona12',
      post: 'Эксперт, автор тематических видеороликов',
      type: 'small',
      description:
        'Митрополит Горловский и Славянский, член Межсоборного присутствия Русской Православной Церкви.',
    },
    {
      id: 4,
      surname: 'Епископ',
      name: 'Макарий (Комогоров)',
      photo: 'persona13',
      post: 'Эксперт, автор тематических видеороликов',
      type: 'small',
      description:
        'Епископом Козельский и Людиновский, заместитель председателя Издательского совета Русской православной церкви.',
    },
    {
      id: 5,
      surname: 'Архимандрит',
      name: 'Агафодор (Поляков)',
      photo: 'persona1',
      post: 'Эксперт, автор тематических видеороликов',
      type: 'small',
      description:
        'Священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, Председатель Общественного Совета г. Горловка, руководитель Молодёжного отдела Горловской Епархии, Магистр Богословия, Ответственный за больничное, госпитальное и волонтёрское служение в Горловской епархии, руководитель и духовник епархиального сестричества им. святого мученика Евгения врача, Преподаватель кафедры философии ДГПУ, Руководитель филиала АНО ЦКБ Святителя Алексия митрополита Московского центра протезирования и медицинской адаптации в Горловке.',
    },
    {
      id: 6,
      surname: 'Священник',
      name: 'Евгений Лищенюк',
      photo: 'persona14',
      post: 'Эксперт, автор тематических видеороликов',
      type: 'small',
      description:
        'Священник Русской Православной Церкви, руководитель епархиального отдела по утверждению трезвости и противодействию наркомании и алкоголизму Воронежской епархии, директор "БФ святителя Антония Смирницкого". Руководит мужским и женским центрами помощи зависимым, двумя приютами для бездомных, входит в состав Совета по информационной политике в сфере профилактики терроризма и экстремизма при Губернаторе Воронежской обл., входит в состав антинаркотической комиссии при Губернаторе Воронежской обл., входит в состав общественного совета при УМВД по г. Воронеж, руководитель Отдела по тюремному служению Воронежской епархии, входит в состав общественного совета при Департаменте социальной защиты Воронежской обл., куратор по организации оказания помощи участникам боевых действий и членам их семей в рамках деятельности Синодального отдела по благотворительности и социальному служению РПЦ, входит в экспертно-общественный совет региональной программы "Герои земли Воронежской", ответственный за организацию работы добровольцев на Донбассе от Воронежской епархии.',
    },
    {
      id: 7,
      surname: 'Священник',
      name: 'Александр Сатомский',
      photo: 'persona15',
      post: 'Эксперт, автор тематических видеороликов',
      type: 'small',
      description:
        'Священник Русской Православной Церкви, настоятель храма Богоявления г. Ярославля Ярославской епархии Русской Православной Церкви, преподаватель Ярославской Духовной Семинарии и Ярославского Государственного Педагогического Университета, пресс-секретарь Ярославской епархии, автор научно-популярной и религиозной литературы.',
    },
  ],
  partners: {
    'gorlovka': 'Горловская епархия',
    'gorlovkaAdmin': 'Администрация г.о. Горловка',
    'debalcevoAdmin': 'Администрация г.о. Дебальцево',
    'vokzaly-donbassa': 'Автовокзалы Донбасса',
    'SMO': 'Синодальный Миссионерский Отдел',
    'izdSovet': 'Издательский Совет РПЦ',
    'radioVera': 'Радио "Вера"',
    'wargonzo': 'WarGonzo',
    'RMH': 'Республиканский Медиа Холдинг',
    'kom-pravda': 'Комсомольская правда',
  },
  finance: {
    'Cредства предоставлены Фондом президентских грантов': 2_994_000.0,
    'Софинансирование': 1_346_111.16,
  },
  photos: {
    // step1: [
    //   'digital/step1_01.webp',
    //   'digital/step1_02.webp',
    //   'digital/step1_03.webp',
    // ],
  },

  // reports: [
  //   {
  //     name: 'Аналитический отчёт',
  //     size: '6.02 MB',
  //     link: 'o_digital_analytical_report',
  //   },
  //   {
  //     name: 'Финансовый отчёт',
  //     size: '466 KB',
  //     link: 'o_digital_financial_report',
  //   },
  // ],
  // docs: [
  //   {
  //     name: 'Плюсы и минусы появления интернета в социальной культуре',
  //     size: '1.35 MB',
  //     link: 'digital_presentation_1',
  //   },
  //   {
  //     name: 'АНО «ДоброГорловка»',
  //     size: '3.58 MB',
  //     link: 'digital_presentation_2',
  //   },
  // ],
  // charts: [
  //   {
  //     name: 'Количество обучающихся',
  //     need: 25,
  //     made: 25,
  //   },
  //   {
  //     name: 'Количество занятий',
  //     need: 35,
  //     made: 36,
  //   },
  //   {
  //     name: 'Количество образовательных часов',
  //     need: 35,
  //     made: 35,
  //   },
  //   {
  //     name: 'Количество единиц контента в сети Интернет',
  //     need: 60,
  //     made: 74,
  //   },
  //   {
  //     name: 'Материалы о проекте в СМИ',
  //     need: 6,
  //     made: 6,
  //   },
  //   {
  //     name: 'Привлеченных экспертов',
  //     need: 4,
  //     made: 11,
  //   },
  //   {
  //     name: 'Количество просмотров',
  //     need: 30_000,
  //     made: 45_782,
  //   },
  // ],
};
