export const DIGITAL = {
  name: 'Экран Добра',
  subname: '',
  photo: 'screen',
  date: '01 июля 2026 – 05 апреля 2027',
  description: [
    'Проект направлен на создание системы информационно-психологической поддержки населения в публичных пространствах путем установки 7 уличных телеэкранов на остановочных комплексах в муниципалитетах ДНР. На экранах будет организован цикличный показ тематических видеороликов, в которых эксперты поднимают остросоциальные темы:',
  ],
  finance: {
    'Cредства предоставлены Фондом президентских грантов': 2_994_000.0,
    'Софинансирование': 1_346_111.16,
  },
  photos: {
    // step1: [
    //   'digital/step1_01.webp',
    //   'digital/step1_02.webp',
    //   'digital/step1_03.webp',
    // ],
  },

  // reports: [
  //   {
  //     name: 'Аналитический отчёт',
  //     size: '6.02 MB',
  //     link: 'o_digital_analytical_report',
  //   },
  //   {
  //     name: 'Финансовый отчёт',
  //     size: '466 KB',
  //     link: 'o_digital_financial_report',
  //   },
  // ],
  // docs: [
  //   {
  //     name: 'Плюсы и минусы появления интернета в социальной культуре',
  //     size: '1.35 MB',
  //     link: 'digital_presentation_1',
  //   },
  //   {
  //     name: 'АНО «ДоброГорловка»',
  //     size: '3.58 MB',
  //     link: 'digital_presentation_2',
  //   },
  // ],
  // charts: [
  //   {
  //     name: 'Количество обучающихся',
  //     need: 25,
  //     made: 25,
  //   },
  //   {
  //     name: 'Количество занятий',
  //     need: 35,
  //     made: 36,
  //   },
  //   {
  //     name: 'Количество образовательных часов',
  //     need: 35,
  //     made: 35,
  //   },
  //   {
  //     name: 'Количество единиц контента в сети Интернет',
  //     need: 60,
  //     made: 74,
  //   },
  //   {
  //     name: 'Материалы о проекте в СМИ',
  //     need: 6,
  //     made: 6,
  //   },
  //   {
  //     name: 'Привлеченных экспертов',
  //     need: 4,
  //     made: 11,
  //   },
  //   {
  //     name: 'Количество просмотров',
  //     need: 30_000,
  //     made: 45_782,
  //   },
  // ],
};
