<template>
  <section id="team">
    <h2>Команда проекта</h2>
    <ModuleTeamWrapper>
      <ModuleTeamItem :photoSrc="`persona2`">
        <template v-slot:surname>Протоиерей</template>
        <template v-slot:name>Дмитрий Абросимов</template>
        <template v-slot:role
          >Руководитель проекта, эксперт, автор тематических
          видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Священник Русской Православной Церкви;</li>
            <li>Клирик Богоявленского кафедрального собора г. Горловка;</li>
            <li>
              Руководитель Отдела по церковной благотворительности и социальному
              служению Горловской Епархии;
            </li>
            <li>Руководитель Миссионерского отдела Горловской Епархии;</li>
            <li>Лектор российского общества "Знаниие";</li>
            <li>Магистр Богословия.</li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona11`">
        <template v-slot:surname>Протоиерей</template>
        <template v-slot:name>Кирилл Щевелев</template>
        <template v-slot:role
          >Координатор проекта, эксперт, автор тематических
          видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Священник Русской Православной Церкви;</li>
            <li>Клирик Богоявленского кафедрального собора г. Горловка;</li>
            <li>
              Руководитель Отдела Религиозного Образования и Катехизации
              Горловской Епархии;
            </li>
            <li>Магистр Богословия.</li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona12`" :type="'line'">
        <template v-slot:surname>Митрополит</template>
        <template v-slot:name>Митрофан (Никитин)</template>
        <template v-slot:role
          >Эксперт, автор тематических видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Митрополит Горловский и Славянский;</li>
            <li>Член Межсоборного присутствия Русской Православной Церкви.</li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona13`" :type="'line'">
        <template v-slot:surname>Епископ</template>
        <template v-slot:name>Макарий (Комогоров)</template>
        <template v-slot:role
          >Эксперт, автор тематических видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Епископом Козельский и Людиновский;</li>
            <li>
              Заместитель председателя Издательского совета Русской Православной
              Церкви.
            </li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona1`" :type="'line'">
        <template v-slot:surname>Поляков</template>
        <template v-slot:name>Иван Викторович</template>
        <template v-slot:role
          >Эксперт, автор тематических видеороликов</template
        >
        <template v-slot:description>
          Архимандрит Агафодор (Поляков) — священник Русской Православной
          Церкви.
          <UiList>
            <li>Клирик Богоявленского кафедрального собора г. Горловка;</li>
            <li>Магистр Богословия;</li>
            <li>Председатель Общественного Совета г. Горловка;</li>
            <li>Руководитель Молодёжного отдела Горловской Епархии;</li>
            <li>
              Ответственный за больничное, госпитальное и волонтёрское служение
              в Горловской епархии;
            </li>
            <li>
              Руководитель и духовник епархиального сестричества им. святого
              мученика Евгения врача;
            </li>
            <li>Преподаватель кафедры философии ДГПУ;</li>
            <li>
              Руководитель филиала АНО ЦКБ Святителя Алексия митрополита
              Московского центра протезирования и медицинской адаптации в
              Горловке.
            </li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona14`" :type="'line'">
        <template v-slot:surname>Священник</template>
        <template v-slot:name>Евгений Лищенюк</template>
        <template v-slot:role
          >Эксперт, автор тематических видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Священник Русской Православной Церкви;</li>
            <li>
              Руководитель епархиального отдела по утверждению трезвости и
              противодействию наркомании и алкоголизму Воронежской епархии;
            </li>
            <li>Директор "БФ святителя Антония Смирницкого";</li>
            <li>
              Руководит мужским и женским центрами помощи зависимым, двумя
              приютами для бездомных;
            </li>
            <li>
              Входит в состав Совета по информационной политике в сфере
              профилактики терроризма и экстремизма при Губернаторе Воронежской
              обл.;
            </li>
            <li>
              Входит в состав антинаркотической комиссии при Губернаторе
              Воронежской обл.;
            </li>
            <li>
              Входит в состав общественного совета при УМВД по г. Воронеж;
            </li>
            <li>
              Руководитель Отдела по тюремному служению Воронежской епархии;
            </li>
            <li>
              Входит в состав общественного совета при Департаменте социальной
              защиты Воронежской обл.;
            </li>
            <li>
              Куратор по организации оказания помощи участникам боевых действий
              и членам их семей в рамках деятельности Синодального отдела по
              благотворительности и социальному служению РПЦ;
            </li>
            <li>
              Входит в экспертно-общественный совет региональной программы
              "Герои земли Воронежской";
            </li>
            <li>
              Ответственный за организацию работы добровольцев на Донбассе от
              Воронежской епархии.
            </li>
          </UiList>
        </template>
      </ModuleTeamItem>
      <ModuleTeamItem :photoSrc="`persona15`" :type="'line'">
        <template v-slot:surname>Священник</template>
        <template v-slot:name>Александр Сатомский</template>
        <template v-slot:role
          >Эксперт, автор тематических видеороликов</template
        >
        <template v-slot:description>
          <UiList>
            <li>Священник Русской Православной Церкви;</li>
            <li>
              Настоятель храма Богоявления г. Ярославля Ярославской епархии РПЦ;
            </li>
            <li>
              Преподаватель Ярославской Духовной Семинарии и Ярославского
              Государственного Педагогического Университета;
            </li>
            <li>Пресс-секретарь Ярославской епархии;</li>
            <li>Автор научно-популярной и религиозной литературы.</li>
          </UiList>
        </template>
      </ModuleTeamItem>
    </ModuleTeamWrapper>
  </section>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss"></style>
