export const ENV = {
	phone: '+7 (949) 593-22-57',
	email: 'DOBROGORLOVKA@YANDEX.RU',
	address: '284637, Донецкая Народная Республика, г. Горловка, пр-кт Победы, д. 112, кв. 7',
	photoArray: ['photo_01', 'photo_02', 'photo_03', 'photo_04','photo_05', 'photo_06'],
	team: [
		{
			id: 1,
			surname: 'Поляков',
			name: 'Иван Викторович',
			photo: 'persona1',
			post: 'Учредитель',
			type: 'big',
			description: 'Архимандрит Агафодор (Поляков) — священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела по делам молодёжи Горловской епархии, ответственный за больничное и волонтерское служение, руководитель и духовник епархиального сестричества им. святого мученика Евгения врача, преподаватель кафедры философии и истории в ДГПУ им. Шаталова, председатель Общественного совета муниципального образования г. Горловка.'
		},
		{
			id: 2,
			surname: 'Абросимов',
			name: 'Дмитрий Викторович',
			photo: 'persona2',
			post: 'Учредитель',
			type: 'big',
			description: 'Священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела по церковной благотворительности и социальному служению Горловской епархии.'
		},
		{
			id: 3,
			surname: 'Ильчук',
			name: 'Михаил Вадимович',
			photo: 'persona0',
			post: 'Учредитель',
			type: 'big',
			description: 'Диакон Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка.'
		},
		{
			id: 4,
			surname: 'Хорьяков',
			name: 'Станислав Владимирович',
			photo: 'persona4',
			post: 'Директор',
			type: 'small',
			description: 'Педадог. Имеет два высших педагогических образования, одно из которых преподаватель истории, второе - организатор физкультуры и спорта. Преподаватель ФГБОУ ВО «ДГПУ им. В. Шаталова».'
		},
		{
			id: 5,
			surname: 'Марковский',
			name: 'Кирилл Николаевич',
			photo: 'persona5',
			post: 'Руководитель волонтёрского движения',
			type: 'small',
			description: 'Помощник руководителя Отдела по делам молодёжи Горловской епархии Русской Православной церкви.'
		},
	],
	partners: [
		{
			name: 'Горловская епархия',
			photo: 'gorlovka',
		},
		{
			name: 'Народный фронт',
			photo: 'onf',
		},
		{
			name: `Милосердие-на-Дону`,
			photo: 'rostov',
		},
	],
	requisites: [
		{
			label: 'ОГРН',
			var: '1249300015777',
		},
		{
			label: 'ИНН',
			var: '9312010716',
		},
		{
			label: 'КПП',
			var: '931201001',
		},
	],
	createdLink: 'https://mynickname.com/MGDArrow'
}