export const ENV = {
  photoArray: [
    'photo_01',
    'photo_02',
    'photo_03',
    'photo_04',
    'photo_05',
    'photo_06',
    'photo_07',
    'photo_08',
    'photo_09',
    'photo_10',
    'photo_11',
    'photo_12',
  ],
  team: [
    {
      id: 1,
      surname: 'Поляков',
      name: 'Иван Викторович',
      photo: 'persona1',
      post: 'Учредитель',
      type: 'big',
      description:
        'Архимандрит Агафодор (Поляков) — священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела по делам молодёжи Горловской епархии, ответственный за больничное и волонтерское служение, руководитель и духовник епархиального сестричества им. святого мученика Евгения врача, преподаватель кафедры философии и истории в ДГПУ им. Шаталова, председатель Общественного совета муниципального образования г. Горловка.',
    },
    {
      id: 2,
      surname: 'Абросимов',
      name: 'Дмитрий Викторович',
      photo: 'persona2',
      post: 'Учредитель',
      type: 'big',
      description:
        'Священник Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка, руководитель Отдела по церковной благотворительности и социальному служению Горловской епархии.',
    },
    {
      id: 3,
      surname: 'Ильчук',
      name: 'Михаил Вадимович',
      photo: 'persona3',
      post: 'Учредитель',
      type: 'big',
      description:
        'Диакон Русской Православной Церкви, клирик Богоявленского кафедрального собора г. Горловка.',
    },
    {
      id: 4,
      surname: 'Хорьяков',
      name: 'Станислав Владимирович',
      photo: 'persona4',
      post: 'Директор',
      type: 'small',
      description:
        'Педадог. Имеет два высших педагогических образования, одно из которых преподаватель истории, второе - организатор физкультуры и спорта. Преподаватель ФГБОУ ВО «ДГПУ им. В. Шаталова».',
    },
    {
      id: 5,
      surname: 'Марковский',
      name: 'Кирилл Николаевич',
      photo: 'persona5',
      post: 'Ответственный за волонтёрскоё движение',
      type: 'small',
      description:
        'Помощник руководителя Отдела по делам молодёжи Горловской епархии Русской Православной Церкви.',
    },
  ],
  partners: {
    gorlovka: 'Горловская епархия',
    onf: 'Народный фронт',
    protorg: 'ООО "Про-Торг"',
    // 'rostov': 'Милосердие-на-Дону',
  },
  requisites: {
    'ОГРН': '1249300015777',
    'ИНН/КПП': '9312010716/931201001',
    'Номер расчетного счета': '40703.810.7.0930 0001183',
    'БИК': '044525555',
    'Номер корреспондентского счета': '30101810400000000555',
  },
  contacts: {
    'Телефон': '+7 (949) 593-22-57',
    'E-mail': 'DOBROGORLOVKA@YANDEX.RU',
    'Юридический адрес':
      '284637, Донецкая Народная Республика, г. Горловка, пр-кт Победы, д. 112, кв. 7',
  },
  messangers: [
    {
      title: '@dobrogorlovkanko',
      photo: 'vk',
      link: 'https://vk.com/dobrogorlovkanko',
    },
    // {
    // 	title: '@dobrogorlovkanko',
    // 	photo: 'tg',
    // 	link: 'https://vk.com/dobrogorlovkanko'
    // }
  ],
  docs: [
    {
      name: 'Устав АНО ДоброГорловка',
      size: '3.48 MB',
      link: 'ustav',
    },
    {
      name: 'ЕГРЮЛ',
      size: '2.57 MB',
      link: 'EGRUL',
    },
    {
      name: 'Свидетельство о постановке на учёт',
      size: '261 KB',
      link: 'uchet',
    },
    {
      name: 'Свидетельство о ГРНО',
      size: '3.08 MB',
      link: 'soGRNO',
    },
  ],
  reports: [
    // {
    // 	'name': 'Отчёт за 2024 год',
    // 	'size': '3.48 MB',
    // 	'link': 'o_2024'
    // },
  ],
  createdLink: 'https://vk.com/mgdarrow',
};

export const DIGITAL = {
  name: 'Цифровой иммунитет',
  subname: 'Учись, Играй, Будь в безопасности',
  photo: 'digital',
  date: '18 августа 2025 – 28 февраля 2026',
  description: [
    'Наша заявка стала победителем второго конкурса Фонда Президентских грантов 2025 и этот проект стал первой грантовой историей в нашей организации.',
    'Проект направлен на обучение детей из многодетных семей, обучающихся в 8-11 классах общеобразовательных школ города Горловки навыкам пользования офисных программ Microsoft Office (Word, Excel, PowerPoint), а также основам кибербезопасности и противостояния кибербуллингу, закладывание в подростков идей о морали в интернете, а также обучение азам гимнастики для поддержания физической формы и избежания болезней при длительной работе за компьютером.',
  ],
  team: [
    {
      id: 1,
      surname: 'Трухачев',
      name: 'Александр Сергеевич',
      photo: 'persona6',
      post: 'Учитель информатики',
      type: 'small',
      description:
        '35 уроков по обучению детей навыкам работы с офисными программами Microsoft Office (Word, Excel, PowerPoint)',
    },
    {
      id: 2,
      surname: 'Хорьяков',
      name: 'Станислав Владимирович',
      photo: 'persona4',
      post: 'Учитель физкультуры',
      type: 'small',
      description:
        'Проведение 6 физкульт занятий по 20 мин с целью обучить детей комплексу упражнений, необходимых для сохранения здоровья при длительной работе с компьютером.',
    },
    {
      id: 3,
      surname: 'Павлова',
      name: 'Вита Викторовна',
      photo: 'persona7',
      post: 'Педагог-психолог ЦППМСП г.о Горловка',
      type: 'small',
      description:
        'Проведение 7 встреч на тему кибербуллинга и противостоянию этому вредоносному явлению',
    },
    {
      id: 4,
      surname: 'Протоиерей',
      name: 'Михаил Фоменко',
      photo: 'persona8',
      post: 'Священник',
      type: 'small',
      description:
        'Проведение 5 встреч на тему нравственности и морали в интернете',
    },
    {
      id: 5,
      surname: 'Священник',
      name: 'Евгений Тимофеев',
      photo: 'persona9',
      post: 'Священник, аспирант СПбДА',
      type: 'small',
      description:
        'Проведение 2 встреч в формате видеоконференции на тему «совесть в режиме инкогнито»',
    },
  ],
  partners: {
    bfStrana: 'БФ "Страна для детей"',
    vesti: 'Вести Донецк',
    kochegarka: 'Газета "Кочегарка ДНР"',
    gorlovkaAdmin: 'Администрация г.о. Горловка',
    gorlovkaObr: 'Управление образования г.о. Горловка',
  },
  finance: {
    'Cредства предоставлены Фондом президентских грантов': 471891.3,
    'Софинансирование': 204090.0,
  },
  photos: {
    step1: [
      'digital/step1_01.webp',
      'digital/step1_02.webp',
      'digital/step1_03.webp',
    ],
    step2_1: [
      'digital/step2_1_01.webp',
      'digital/step2_1_02.webp',
      'digital/step2_1_03.webp',
      'digital/step2_1_04.webp',
    ],
    step2_2: [
      'digital/step2_2_01.webp',
      'digital/step2_2_02.webp',
      'digital/step2_2_03.webp',
      'digital/step2_2_04.webp',
    ],
    step3_1: [
      'digital/step3_1_01.webp',
      'digital/step3_1_02.webp',
      'digital/step3_1_03.webp',
      'digital/step3_1_04.webp',
    ],
    step3_2: [
      'digital/step3_2_01.webp',
      'digital/step3_2_02.webp',
      'digital/step3_2_03.webp',
    ],
    step3_3: ['digital/step3_3_01.webp', 'digital/step3_3_02.webp'],
    step3_4: [
      'digital/step3_4_01.webp',
      'digital/step3_4_02.webp',
      'digital/step3_4_03.webp',
      'digital/step3_4_04.webp',
    ],
    step3_5: ['digital/step3_5_01.webp', 'digital/step3_5_02.webp'],
    step4_1: [
      {
        type: 'photo',
        photo: 'digital/step4_1_09_18_01.webp',
        date: '18/09/2025',
      },
      {
        type: 'photo',
        photo: 'digital/step4_1_09_18_02.webp',
        date: '18/09/2025',
      },
      {
        type: 'photo',
        photo: 'digital/step4_1_09_23_01.webp',
        date: '23/09/2025',
      },
      {
        type: 'photo',
        photo: 'digital/step4_1_09_30_01.webp',
        date: '30/09/2025',
      },
    ],
    step4_2: [
      {
        type: 'photo',
        photo: 'digital/step4_2_09_18_01.webp',
        date: '18/09/2025',
      },
      {
        type: 'photo',
        photo: 'digital/step4_2_10_02_01.webp',
        date: '02/10/2025',
      },
    ],
  },
};
export const PULSE = {
  name: 'Пульс Добра',
  subname: '',
  photo: 'pulse',
  date: 'постоянная, периодическая',
  description: [
    'Проект создан нашими партнерами: Отделом социального служения Горловской епархии Русской Православной Церкви. Он представляет собой акции по сдаче донорской крови и её компонентов. «Пульс добра» призван повысить количество потенциальных доноров среди молодёжи города Горловки путём проведения не менее пяти акций в год по донациям, которые необходимы медицинским учреждениям города.',
    'Директор, сотрудники и активисты «ДоброГорловки» регулярно присоединяются к этому полезному и важному делу.',
  ],
  partners: {
    ossibge: 'Отдел социального служения Горловской Епархии',
  },
  photos: {
    step1: [
      'pulse/step1_01.webp',
      'pulse/step1_02.webp',
      'pulse/step1_03.webp',
    ],
  },
};
export const RILL = {
  name: 'Родник Добра',
  subname: '',
  photo: 'rill',
  date: 'постоянная, периодическая',
  description: [
    'Ситуация в Республике с водой уже долгое время остаётся очень напряжённой. «ДоброГорловка» не стоит в стороне с самого своего основания — наши волонтёры плечом к плечу, совместно с молодёжными организациями города, православной молодёжью Горловской епархии, помогают адресно закрывать потребности с питьевой водой маломобильным одиноким и пожилым людям. И вот с 26 августа стартовал новый шаг нашей работы в этой сфере! «ДоброГорловка» взяла в аренду у департамента ЖКХ г. Горловка, спецтехнику для развоза воды — КАМАЗ.',
  ],
  partners: {
    gorlovka: 'Горловская епархия',
    protorg: 'ООО "Про-Торг"',
  },
  photos: {
    step1_1: [
      'rill/step1_1_01.webp',
      'rill/step1_1_02.webp',
      'rill/step1_1_03.webp',
      'rill/step1_1_04.webp',
    ],
    step1_2: [
      'rill/step1_2_01.webp',
      'rill/step1_2_02.webp',
      'rill/step1_2_03.webp',
      'rill/step1_2_04.webp',
      'rill/step1_2_05.webp',
    ],
  },
};

export const loadingValue = ref(false);

export const setLoading = () => {
  loadingValue.value = true;
  setTimeout(() => (loadingValue.value = false), 2000);
};

export const getHrefContacts = (label: string, value: string) => {
  if (label === 'Телефон') return `tel:+${value.replace(/\D/g, '')}`;
  if (label === 'E-mail') return `mailto:${value}`;
  if (label === 'Юридический адрес')
    return `https://yandex.ru/maps/?whatshere[point]=37.996122,48.306559&whatshere[zoom]=17`;
  return '';
};
