<template>
  <section id="block">
    <ClientOnly>
      <MenuClient :menu />
    </ClientOnly>
    <div class="project__updeck">
      <ProjectsImage :photo-src="project.photo" />
      <div class="project__info point" id="about">
        <ProjectsName>
          <h2>{{ project.name }}</h2>
          <span>{{ project.subname }}</span>
        </ProjectsName>
        <ProjectsDate>
          <strong>Реализация проекта:</strong><span>{{ project.date }}</span>
        </ProjectsDate>
        <ProjectsDescription>
          <p v-for="(descript, index) in project.description" :key="index">
            {{ descript }}
          </p>
        </ProjectsDescription>
      </div>
    </div>
    <div class="project__updeck">
      <div
        class="project__info point"
        id="finance"
        style="scroll-margin-block-start: 50px"
      >
        <ProjectsFinance
          :title="'Финансирование проекта'"
          :data="project.finance"
        />
      </div>
      <img
        src="/public/partners/pgrants_vertical.webp"
        alt="При поддержке Фонда Президентских Грантов"
        class="pgrants-vertical"
      />
      <img
        src="/public/partners/pgrants_horizontal.png"
        alt="При поддержке Фонда Президентских Грантов"
        class="pgrants-horizontal"
      />
    </div>
    <Team
      :title="'Команда проекта'"
      :big-cards="bigCards"
      :small-cards="smallCards"
      id="team"
      class="point"
    />
    <Partners
      :title="'Партнёры проекта'"
      :partners="project.partners"
      class="project-partners point"
      id="partners"
    />
    <ProjectsStep
      :title="'Шаг 4. Обучение.'"
      :subtitle="''"
      :date="'18.09.2025 – 28.02.2026'"
      :status="'Активный'"
      id="step4"
      class="point"
    >
      <p>
        В ходе занятий наши дети получают не менее
        <UiStrong>35 образовательных часов</UiStrong> с привлечением не менее
        четырёх экспертов по разным направлениям.
      </p>
      <p>Эти эксперты — члены нашей команды и партнёры.</p>
      <h4>Уроки по информатике</h4>
      <p>
        Блок занятий по обучению навыкам пользования офисных программ Microsoft
        Office (Word, Excel, PowerPoint) проводит
        <UiStrong>Трухачев Александр Сергеевич</UiStrong> — руководитель
        Методического Объединения учителей информатики города.
      </p>
      <p>
        Он помогает освоить основы редактирования и форматорвания текста, учит
        печатать документы, создавать рефераты, работе с таблицами, ячейками и
        функциями, созданию диаграмм и графиков, работе со слайдами и многому
        другому.
      </p>
      <ProjectsPhotos :photos="photos.step4_1" :photos-all="photosAll" />
      <h4>Занятия с психологом</h4>
      <p>
        <UiStrong>Павлова Вита Викторовна</UiStrong> – Педагог-психолог ЦППМСП
        г. Горловка. Она проводит встречи, на которых рассказывает интересную и
        практическую информацию на тему буллинга, кибербуллинга и противостоянию
        этому вредоносному явлению.
      </p>
      <ProjectsPhotos :photos="photos.step4_2" :photos-all="photosAll" />
    </ProjectsStep>
    <ProjectsStep
      :title="'Шаг 3. Открытие.'"
      :subtitle="''"
      :date="'16.09.2025'"
      id="step3"
      class="point"
    >
      <p>
        <UiStrong>16 сентября</UiStrong> состоялось начало обучения детей в
        рамках проекта
        <UiStrong
          >«Цифровой иммунитет: учись, играй, будь в безопасности», реализуемого
          при поддержке Фонда Президентских Грантов»</UiStrong
        >.
      </p>
      <ProjectsPhotos :photos="photos.step3_1" :photos-all="photosAll" />
      <p>
        На открытии в качестве высокого гостя присутствовала глава Управления
        образования города Горловки <UiStrong>Мария Яношевна Полубан</UiStrong>.
      </p>
      <ProjectsPhotos :photos="photos.step3_2" :photos-all="photosAll" />
      <p>
        Первая встреча учителей и учащихся началась с
        <UiStrong>общего молебна</UiStrong>, котором мы все попросили помощи
        Господней на начинающиеся доброе дело. Далее с приветственным словом
        выступила Мария Янушевна Полубан, которая подчеркнула важность участия в
        грантовых проектах и пожелала успеха в реализации.
      </p>
      <ProjectsPhotos :photos="photos.step3_3" :photos-all="photosAll" />
      <p>
        Далее <UiStrong>Александр Сергеевич Трухачев</UiStrong> — наш учитель
        информатики провел первое вводное занятие с детьми, в котором очертил
        весь блок тем, которые будут реализованы в рамках нашего проекта
        рассказал о структуре будущих личных проектов детей, поговорил с ними о
        тех результатах, которые они сами ожидают от обучения и которые ожидаем
        от них увидеть мы, ответил на интересующие вопросы и проговорил все
        организационные моменты.
      </p>
      <ProjectsPhotos :photos="photos.step3_4" :photos-all="photosAll" />
      <p>
        Закончилась встреча с чаепитием в неформальной обстановке, где мы
        обменялись впечатлениями и планами.
      </p>
      <ProjectsPhotos :photos="photos.step3_5" :photos-all="photosAll" />
    </ProjectsStep>
    <ProjectsStep
      :title="'Шаг 2. Подготовка.'"
      :subtitle="''"
      :date="'18.08.2025 — 15.09.2025'"
      id="step2"
      class="point"
    >
      <h4>Подготовительная работа по проведению обучающего курса</h4>
      <p>
        В рамках подготовки к непосредственно обучению детей было проделано
        немало работы.
      </p>
      <p>
        Во-первых, мы заказали и закупили все необходимое техническое
        оборудование и инвентарь для проведения учебного процесса, согласно
        грантовой заявке, на средства, выделенные ФПГ
        <UiStrong>на сумму 375 885₽</UiStrong>.
      </p>
      <ProjectsPhotos :photos="photos.step2_1" :photos-all="photosAll" />
      <p>
        Во-вторых, путем онлайн-заполнения Яндекс-форм желающими, а также путем
        личного и онлайн собеседования мы отобрали в группу для дальнейшего
        обучения <UiStrong>25 подростков из многодетных семей</UiStrong>,
        обучающиеся в <UiStrong>8-11 классах</UiStrong> общеобразовательных школ
        г. Горловка Донецкой Народной Республики, для обучения их работе с
        программами Microsoft Office, цифровой грамотности, физическим
        упражнениям, чтобы смотреть вместе интересные видео, говорить о
        нравственности и противодействии буллингу.
      </p>
      <ProjectsPhotos :photos="photos.step2_2" :photos-all="photosAll" />
    </ProjectsStep>
    <ProjectsStep
      :title="'Шаг 1. Старт: '"
      :subtitle="'от идеи к заявке'"
      :date="'16.03.2025 — 15.06.2025'"
      id="step1"
      class="point"
    >
      <h4>
        Какие проблемы стали причиной рождения идеи написания грантовой заявки?
      </h4>
      <p>
        В современном мире уверенное владение компьютером — это не просто
        удобный навык, а необходимость. Однако для многих подростков, особенно
        из многодетных семей, доступ к цифровым знаниям остается ограниченным.
        Именно с этой проблемой столкнулась «ДоброГорловка», работая с
        незащищенными слоями населения.
      </p>
      <p>
        Родители в таких семьях, целиком посвящая себя заботе о материальном
        благополучии, часто не имеют возможности помочь детям с освоением
        digital-навыков. В результате старшеклассники оказываются предоставлены
        сами себе и могут отставать от сверстников, что в будущем затрудняет их
        поступление в вузы и построение карьеры.
      </p>
      <p>
        Масштаб проблемы подтвердил социологический опрос, проведенный среди
        проведенном среди десяти представителей целевой аудитории. Его
        результаты:
      </p>
      <ul>
        <li>
          Несмотря на то, что <UiStrong>у 80% опрошенных</UiStrong> дома есть
          компьютер или ноутбук, лишь половина знает, как изменить шрифт в
          документе Word;
        </li>
        <li>
          Создавать презентации в PowerPoint умеют
          <UiStrong>только 30%</UiStrong>;
        </li>
        <li>
          Самый тревожный показатель — никто не знал, что табличный редактор
          Excel умеет проводить математические расчеты автоматически;
        </li>
        <li>
          При этом <UiStrong>90% ребят</UiStrong> выразили желание научиться
          работать с офисными программами.
        </li>
      </ul>
      <h4>Почему реализация проекта поможет в решении проблем?</h4>
      <p>
        Эти цифры стали отправной точкой для создания нового социального проекта
        —
        <UiStrong
          >«Цифровой иммунитет: учись, играй, будь в безопасности»</UiStrong
        >. Проект ставит перед собой задачу научить детей из многодетных семей,
        обучающихся в 8-11 классах общеобразовательных школ города Горловки
        Донецкой Народной Республики и не имеющих навыков работы с офисными
        программами Microsoft Office, создавать, редактировать и форматировать
        текстовые документы, работать с таблицами, проводить расчеты и
        анализировать данные, создавать презентации, визуализировать информацию
        и выступать с докладами, а также обучить их основам кибербезопасности.
      </p>
      <p>В ходе проекта мы:</p>
      <ul>
        <li>
          Проведем подготовительную работу по проведению обучающего курса;
        </li>
        <li>
          Обучим детей работе с программами Microsoft Office, физическим
          упражнениям для защиты здоровья при длительной работе за компьютером и
          основам кибербезопасности, православной нравственности,
          противодействию кибербуллингу.
        </li>
      </ul>
      <p>
        Финалом обучения станет презентация собственных проектов, где каждый
        участник сможет блеснуть новыми знаниями. Полученные навыки — это не
        просто галочка, а реальный «цифровой иммунитет», который в будущем
        пригодится для поступления в средние и высшие учебные заведения, а также
        при трудоустройстве.
      </p>
      <p>
        Реализация этого важного проекта стала возможной благодаря поддержке
        Фонда Президентских грантов, который поверил в идею и выделил средства
        на ее воплощение. Это инвестиция в будущее молодого поколения Донецкой
        Народной Республики.
      </p>
      <ProjectsPhotos :photos="photos.step1" :photos-all="photosAll" />
    </ProjectsStep>
  </section>
</template>

<script setup lang="ts">
  import { getAllPhoto, DIGITAL as project } from '~/assets/env';
  import MenuClient from '~/components/projects/Menu.client.vue';

  const bigCards = project.team;
  const smallCards = ref(
    project.team.filter((persona) => persona.type === 'small'),
  );

  const menu = [
    { name: 'О проекте', id: 'about' },
    { name: 'Финансирование проекта', id: 'finance' },
    { name: 'Команда проекта', id: 'team' },
    { name: 'Партнёры проекта', id: 'partners' },
    { name: 'Шаг 4. Обучение', id: 'step4' },
    { name: 'Шаг 3. Открытие', id: 'step3' },
    { name: 'Шаг 2. Подготовка', id: 'step2' },
    { name: 'Шаг 1. Старт', id: 'step1' },
  ];

  const photos = project.photos;

  const photosAll = getAllPhoto(project.photos);
</script>

<style scoped lang="scss"></style>
