<template>
  <div class="mainpage">
    <Team/>
    <!-- <p>История о нас</p>
    <p>Фотогаларея — Лучшие фото из жизни организации</p>
    <p>Контакты — контакты, реквизиты, документы и отчёты — Учредительные Устав и др. учредительные документы и Отчеты (открытая отчетность как финансовая так и аналитическая)</p>
    <p>Партнёры — организации партнёров</p>
    <p>Проекты</p> -->
  </div>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
.mainpage{
  width: 100%;
}
</style>
