<template>
  <section class="about">
	<h2>О нас</h2>
  <p>Автономная Некоммерческая Организация "ДоброГорловка" - социально ориентированная организация, созданная в сентябре 2024 года, внимание и работа которой направлена на улучшение качества жизни социально незащищенных категорий граждан, а также на духовно-патриотическое воспитание молодежи.</p>
  <p>Рады привествовать вас у нас на сайте. Мы работаем для того, чтобы сделать лучше жизнь людей, которым требуется помощь и поддержка.
Присоединяйтесь к нашему движению:
👉 Делись нашими постами — пусть о добрых делах узнает больше людей.
👉 Стань волонтёром — иногда для важных перемен нужны просто ваши руки и доброе сердце.</p>
	</section>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
.about{
  width: 100%;
}
</style>
